In [62]:
import pandas as pd
import numpy as np

In [11]:
#Series
labels = ['a', 'b', 'c','d','e']
my_data = [10,20,30,40,50]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [9]:
pd.Series(data = my_data)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [18]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [19]:
 pd.Series(arr)

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [21]:
pd.Series(arr, labels)

a    10
b    20
c    30
d    40
e    50
dtype: int32

In [22]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [23]:
pd.Series(labels)

0    a
1    b
2    c
3    d
4    e
dtype: object

In [24]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [27]:
ser1 = pd.Series([1,2,3,4],['IND','USA','AUS','JAPAN'])
ser1

IND      1
USA      2
AUS      3
JAPAN    4
dtype: int64

In [41]:
ser2 = pd.Series([1,2,5,6],['IND', 'Nepal', 'SriLanka', 'Maldives'])
ser2

IND         1
Nepal       2
SriLanka    5
Maldives    6
dtype: int64

In [29]:
ser1['IND']

1

In [31]:
ser3 = pd.Series(data=labels)
ser3

0    a
1    b
2    c
3    d
4    e
dtype: object

In [35]:
ser3[3]

'd'

In [36]:
ser1

IND      1
USA      2
AUS      3
JAPAN    4
dtype: int64

In [42]:
ser2

IND         1
Nepal       2
SriLanka    5
Maldives    6
dtype: int64

In [43]:
ser1+ser2

AUS         NaN
IND         2.0
JAPAN       NaN
Maldives    NaN
Nepal       NaN
SriLanka    NaN
USA         NaN
dtype: float64

In [44]:
#DATAFRAMES

In [63]:
from numpy.random import randn

In [64]:
np.random.seed(101)

In [54]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.026105 -1.678284  0.333973 -0.532471
B  2.117727  0.197524  2.302987  0.729024
C -0.863091  0.305632  0.243178  0.864165
D -1.560931 -0.251897 -0.578120  0.236996
E  0.200780  0.327845  0.674485 -0.174057

In [13]:
df['W']

A    0.386030
B    0.681209
C   -1.005187
D   -1.382920
E    0.992573
Name: W, dtype: float64

In [14]:
type(df['W'])

pandas.core.series.Series

In [15]:
type(df)

pandas.core.frame.DataFrame

In [19]:
df.W         #dont use this, as it may confuse panda with the existing methods

A    0.386030
B    0.681209
C   -1.005187
D   -1.382920
E    0.992573
Name: W, dtype: float64

In [18]:
df.W['D']

-1.3829200981158674

In [55]:
#getting multiple columns-
df[['W','X']]

          W         X
A  0.026105 -1.678284
B  2.117727  0.197524
C -0.863091  0.305632
D -1.560931 -0.251897
E  0.200780  0.327845

In [44]:
#creating a new columns-
df['NEW'] = df['W'] + df['X']

In [23]:
df

          W         X         Y         Z       NEW
A  0.386030  2.084019 -0.376519  0.230336  2.470049
B  0.681209  1.035125 -0.031160  1.939932  1.716334
C -1.005187 -0.741790  0.187125 -0.732845 -1.746977
D -1.382920  1.482495  0.961458 -2.141212  0.099575
E  0.992573  1.192241 -1.046780  1.292765  2.184814

In [35]:
df.drop('NEW', axis=1)

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [36]:
df

          W         X         Y         Z       NEW
A  0.386030  2.084019 -0.376519  0.230336  2.470049
B  0.681209  1.035125 -0.031160  1.939932  1.716334
C -1.005187 -0.741790  0.187125 -0.732845 -1.746977
D -1.382920  1.482495  0.961458 -2.141212  0.099575
E  0.992573  1.192241 -1.046780  1.292765  2.184814

In [45]:
# to delete the data from panda use 'inplace' as true
df.drop('NEW', axis=1, inplace = True)

In [46]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [47]:
df.drop('E')

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212

In [48]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [50]:
df.drop('E', inplace = True)

In [51]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212

In [52]:
df.shape

(4, 4)

In [57]:
df

          W         X         Y         Z
A  0.026105 -1.678284  0.333973 -0.532471
B  2.117727  0.197524  2.302987  0.729024
C -0.863091  0.305632  0.243178  0.864165
D -1.560931 -0.251897 -0.578120  0.236996
E  0.200780  0.327845  0.674485 -0.174057

In [56]:
df.shape

(5, 4)

In [63]:
#seelct items in column
df['W']

A    0.026105
B    2.117727
C   -0.863091
D   -1.560931
E    0.200780
Name: W, dtype: float64

In [65]:
#select items in row
df.loc['E']

W    0.200780
X    0.327845
Y    0.674485
Z   -0.174057
Name: E, dtype: float64

In [66]:
df.loc['E']['Y']

0.674485186989649

In [68]:
df.iloc[2]

W   -0.863091
X    0.305632
Y    0.243178
Z    0.864165
Name: C, dtype: float64

In [69]:
#selecting subset
df.loc['E','Y']

0.674485186989649

In [70]:
df.loc['B','Y']

2.3029872653509056

In [71]:
df

          W         X         Y         Z
A  0.026105 -1.678284  0.333973 -0.532471
B  2.117727  0.197524  2.302987  0.729024
C -0.863091  0.305632  0.243178  0.864165
D -1.560931 -0.251897 -0.578120  0.236996
E  0.200780  0.327845  0.674485 -0.174057

In [72]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.026105  0.333973
B  2.117727  2.302987

In [73]:
#conditional selection
df > 0

       W      X      Y      Z
A   True  False   True  False
B   True   True   True   True
C  False   True   True   True
D  False  False  False   True
E   True   True   True  False

In [74]:
boolDf = df>0

In [75]:
boolDf

       W      X      Y      Z
A   True  False   True  False
B   True   True   True   True
C  False   True   True   True
D  False  False  False   True
E   True   True   True  False

In [76]:
df[boolDf]

          W         X         Y         Z
A  0.026105       NaN  0.333973       NaN
B  2.117727  0.197524  2.302987  0.729024
C       NaN  0.305632  0.243178  0.864165
D       NaN       NaN       NaN  0.236996
E  0.200780  0.327845  0.674485       NaN

In [77]:
df[df<0]

          W         X        Y         Z
A       NaN -1.678284      NaN -0.532471
B       NaN       NaN      NaN       NaN
C -0.863091       NaN      NaN       NaN
D -1.560931 -0.251897 -0.57812       NaN
E       NaN       NaN      NaN -0.174057

In [78]:
df[df>0]

          W         X         Y         Z
A  0.026105       NaN  0.333973       NaN
B  2.117727  0.197524  2.302987  0.729024
C       NaN  0.305632  0.243178  0.864165
D       NaN       NaN       NaN  0.236996
E  0.200780  0.327845  0.674485       NaN

In [79]:
df['W']>0

A     True
B     True
C    False
D    False
E     True
Name: W, dtype: bool

In [80]:
df[df['W']>0]

          W         X         Y         Z
A  0.026105 -1.678284  0.333973 -0.532471
B  2.117727  0.197524  2.302987  0.729024
E  0.200780  0.327845  0.674485 -0.174057

In [81]:
df

          W         X         Y         Z
A  0.026105 -1.678284  0.333973 -0.532471
B  2.117727  0.197524  2.302987  0.729024
C -0.863091  0.305632  0.243178  0.864165
D -1.560931 -0.251897 -0.578120  0.236996
E  0.200780  0.327845  0.674485 -0.174057

In [82]:
bd = df[df['W']>0]

In [83]:
bd['W']

A    0.026105
B    2.117727
E    0.200780
Name: W, dtype: float64

In [88]:
#get all dataframe where Z is greater than 0
df['Z']>0

A    False
B     True
C     True
D     True
E    False
Name: Z, dtype: bool

In [89]:
df[df['Z']>0]

          W         X         Y         Z
B  2.117727  0.197524  2.302987  0.729024
C -0.863091  0.305632  0.243178  0.864165
D -1.560931 -0.251897 -0.578120  0.236996

In [87]:
md = df[df['Z']>0]
md['Z']

B    0.729024
C    0.864165
D    0.236996
Name: Z, dtype: float64

In [90]:
df[df['Z']>0].Z

B    0.729024
C    0.864165
D    0.236996
Name: Z, dtype: float64

In [91]:
df[df['Z']>0]['Z']

B    0.729024
C    0.864165
D    0.236996
Name: Z, dtype: float64

In [92]:
df[df['Z']>0][['X','Z']]

          X         Z
B  0.197524  0.729024
C  0.305632  0.864165
D -0.251897  0.236996

In [98]:
df[df['Z']>0].loc['B']

W    2.117727
X    0.197524
Y    2.302987
Z    0.729024
Name: B, dtype: float64

In [105]:
df[df['Z']>0].loc['B','Z']

0.7290237321354455

In [106]:
df

          W         X         Y         Z
A  0.026105 -1.678284  0.333973 -0.532471
B  2.117727  0.197524  2.302987  0.729024
C -0.863091  0.305632  0.243178  0.864165
D -1.560931 -0.251897 -0.578120  0.236996
E  0.200780  0.327845  0.674485 -0.174057

In [108]:
df[(df['Y']>0) and (df['W']>1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [115]:
df[(df['Y']>0) | (df['W']>1)]

          W         X         Y         Z
A  0.026105 -1.678284  0.333973 -0.532471
B  2.117727  0.197524  2.302987  0.729024
C -0.863091  0.305632  0.243178  0.864165
E  0.200780  0.327845  0.674485 -0.174057

In [116]:
df[(df['Y']>0) & (df['W']>1)]

          W         X         Y         Z
B  2.117727  0.197524  2.302987  0.729024

In [117]:
df

          W         X         Y         Z
A  0.026105 -1.678284  0.333973 -0.532471
B  2.117727  0.197524  2.302987  0.729024
C -0.863091  0.305632  0.243178  0.864165
D -1.560931 -0.251897 -0.578120  0.236996
E  0.200780  0.327845  0.674485 -0.174057

In [119]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.026105 -1.678284  0.333973 -0.532471
1     B  2.117727  0.197524  2.302987  0.729024
2     C -0.863091  0.305632  0.243178  0.864165
3     D -1.560931 -0.251897 -0.578120  0.236996
4     E  0.200780  0.327845  0.674485 -0.174057

In [120]:
newInd = 'CA OR WY NY CO'.split()
newInd

['CA', 'OR', 'WY', 'NY', 'CO']

In [121]:
df['States'] = newInd
df

          W         X         Y         Z States
A  0.026105 -1.678284  0.333973 -0.532471     CA
B  2.117727  0.197524  2.302987  0.729024     OR
C -0.863091  0.305632  0.243178  0.864165     WY
D -1.560931 -0.251897 -0.578120  0.236996     NY
E  0.200780  0.327845  0.674485 -0.174057     CO

In [122]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.026105 -1.678284  0.333973 -0.532471
OR      2.117727  0.197524  2.302987  0.729024
WY     -0.863091  0.305632  0.243178  0.864165
NY     -1.560931 -0.251897 -0.578120  0.236996
CO      0.200780  0.327845  0.674485 -0.174057

In [123]:
df

          W         X         Y         Z States
A  0.026105 -1.678284  0.333973 -0.532471     CA
B  2.117727  0.197524  2.302987  0.729024     OR
C -0.863091  0.305632  0.243178  0.864165     WY
D -1.560931 -0.251897 -0.578120  0.236996     NY
E  0.200780  0.327845  0.674485 -0.174057     CO

In [125]:
df.set_index('States', inplace= True)

In [126]:
df

               W         X         Y         Z
States
CA      0.026105 -1.678284  0.333973 -0.532471
OR      2.117727  0.197524  2.302987  0.729024
WY     -0.863091  0.305632  0.243178  0.864165
NY     -1.560931 -0.251897 -0.578120  0.236996
CO      0.200780  0.327845  0.674485 -0.174057

In [14]:
#multi index and index heirarchy
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_indexs = pd.MultiIndex.from_tuples(hier_index)

In [6]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [7]:
inside

[1, 2, 3, 1, 2, 3]

In [8]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [9]:
pd.MultiIndex.from_tuples(hier_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [15]:
hier_indexs

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [31]:
df = pd.DataFrame(randn(6,2), hier_indexs, ['A','B'])

In [32]:
df

             A         B
G1 1 -0.134841  0.390528
   2  0.166905  0.184502
   3  0.807706  0.072960
G2 1  0.638787  0.329646
   2 -0.497104 -0.754070
   3 -0.943406  0.484752

In [33]:
df.loc['G1']

          A         B
1 -0.134841  0.390528
2  0.166905  0.184502
3  0.807706  0.072960

In [35]:
df.loc['G1'].loc[1]

A   -0.134841
B    0.390528
Name: 1, dtype: float64

In [37]:
df.loc['G1']['A']

1   -0.134841
2    0.166905
3    0.807706
Name: A, dtype: float64

In [41]:
#naming index
df.index.names

FrozenList([None, None])

In [43]:
df.index.names = ['Groups', 'Num']
df

                   A         B
Groups Num
G1     1   -0.134841  0.390528
       2    0.166905  0.184502
       3    0.807706  0.072960
G2     1    0.638787  0.329646
       2   -0.497104 -0.754070
       3   -0.943406  0.484752

In [44]:
df.loc['G2'].loc[2]['B']

-0.7540697010400628

In [46]:
df.loc['G1'].loc[2]['A']

0.16690463609281317

In [48]:
df.loc['G2'].loc[3]['A']

-0.9434064032519315

In [49]:
#cross section
df.loc['G1']

            A         B
Num
1   -0.134841  0.390528
2    0.166905  0.184502
3    0.807706  0.072960

In [50]:
df.xs('G1')

            A         B
Num
1   -0.134841  0.390528
2    0.166905  0.184502
3    0.807706  0.072960

In [51]:
df

                   A         B
Groups Num
G1     1   -0.134841  0.390528
       2    0.166905  0.184502
       3    0.807706  0.072960
G2     1    0.638787  0.329646
       2   -0.497104 -0.754070
       3   -0.943406  0.484752

In [53]:
df.xs(1, level = 'Num')

               A         B
Groups
G1     -0.134841  0.390528
G2      0.638787  0.329646

In [61]:
df.xs(3, level = 'Num')

               A         B
Groups
G1      0.807706  0.072960
G2     -0.943406  0.484752

In [77]:
#Missing Date
import pandas as pd
import numpy as np

In [82]:
d = {'A' : [1,2, np.nan], 'B' : [5,np.nan, np.nan], 'C' : [1,2,3]}

In [84]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [85]:
df.dropna()#row drop - use inplace = true to drop permanently

     A    B  C
0  1.0  5.0  1

In [87]:
df.dropna(axis=1)#column drop - use inplace = true to drop permanently

   C
0  1
1  2
2  3

In [89]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [94]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [96]:
#filling missing value
df.fillna(value= 'Fill Value')

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [98]:
#filling mean of value
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [101]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [103]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [104]:
df.notnull()

       A      B     C
0   True   True  True
1   True  False  True
2  False  False  True

In [105]:
df.isna()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [106]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [122]:
df['D'] = df['A']+df['B']

In [124]:
df

     A    B  C    D
0  1.0  5.0  1  6.0
1  2.0  NaN  2  NaN
2  NaN  NaN  3  NaN

In [131]:
df.drop('D', axis=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [128]:
df.dropna(thresh=3)

     A    B  C    D
0  1.0  5.0  1  6.0

In [132]:
df

     A    B  C    D
0  1.0  5.0  1  6.0
1  2.0  NaN  2  NaN
2  NaN  NaN  3  NaN

In [134]:
df.drop('D', axis=1, inplace=True)

In [135]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [136]:
df.fillna('New')

     A    B  C
0  1.0  5.0  1
1  2.0  New  2
2  New  New  3

In [137]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [139]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [140]:
#Groupby

In [142]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [143]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [146]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [148]:
byComapny = df.groupby('Company')

In [149]:
byComapny

In [150]:
byComapny.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [151]:
byComapny.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [152]:
byComapny.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [155]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [156]:
byComapny.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [157]:
byComapny.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [160]:
byComapny.sum().loc['GOOG']

Sales    320
Name: GOOG, dtype: int64

In [163]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [165]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [166]:
df.describe()

            Sales
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000

In [168]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [175]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [188]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [184]:
df.groupby('Company').describe().loc['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [189]:
#Merging Joining and Concatenating

In [191]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [192]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [193]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [194]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [196]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [197]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [198]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [199]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [200]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [201]:
pd.concat([left, right])

  key    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K1   A1   B1  NaN  NaN
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3  NaN  NaN
0  K0  NaN  NaN   C0   D0
1  K1  NaN  NaN   C1   D1
2  K2  NaN  NaN   C2   D2
3  K3  NaN  NaN   C3   D3

In [202]:
pd.concat([left, right], axis=1)

  key   A   B key   C   D
0  K0  A0  B0  K0  C0  D0
1  K1  A1  B1  K1  C1  D1
2  K2  A2  B2  K2  C2  D2
3  K3  A3  B3  K3  C3  D3

In [204]:
pd.merge(left, right,'inner', on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [205]:
pd.merge(left, right, 'outer', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [206]:
left1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right1 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [207]:
left1

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [208]:
right1

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [210]:
pd.merge(left1, right1, how='inner', on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [212]:
pd.merge(left1, right1, how='outer', on = ['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [213]:
pd.merge(left1, right1, how='right', on = ['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [214]:
pd.merge(left1, right1, how='left', on = ['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [215]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [217]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [218]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [219]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [221]:
#Operations
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [222]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [223]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [226]:
#finding unique value in dataframe
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [230]:
len(df['col2'].unique())

3

In [232]:
df['col2'].nunique()

3

In [233]:
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

In [236]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [237]:
#selecting data
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [238]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [239]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [240]:
df[(df['col1']>2) & (df['col2'] > 500)]

   col1  col2 col3
2     3   666  ghi

In [243]:
#Apply method
#apply custom function

def times2(x):
    return x**2

In [244]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [242]:
df['col2'].sum()

2109

In [245]:
df['col2'].apply(times2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [246]:
def lenString(x):
    return len(x)

In [247]:
df['col3'].apply(lenString)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [250]:
#applying with lambda function
df['col2'].apply(lambda x : x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [257]:
df.drop('col3', axis=1)

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

In [258]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [259]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [263]:
type(df['col3'].loc[1])

str

In [264]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [266]:
#ordering/sorting 
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [267]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [268]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [269]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [270]:
#pivot table - creating mutiple index for given table
df.pivot('C',['A','B'])

     D
A  foo       bar
B  one  two  two  one
C
x  1.0  2.0  NaN  4.0
y  3.0  NaN  5.0  1.0

In [277]:
df.pivot_table(values='D', index=['A','B'], columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [303]:
#Data Input and Output
#CSV, Excel, Html, Sql
import pandas as pd

In [293]:
pd.read_csv("/Users/divya/Udemy_sampleFiles/example")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [295]:
df = pd.read_csv("/Users/divya/Udemy_sampleFiles/example")
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [297]:
df.to_csv("/Users/divya/Udemy_sampleFiles/myoutput_sample.csv")

In [299]:
df.to_csv("/Users/divya/Udemy_sampleFiles/myUoutput_example_withoutIndex.csv", index=False)

In [300]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [301]:
pd.read_csv("/Users/divya/Udemy_sampleFiles/myoutput_sample.csv")

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [304]:
pd.read_csv("/Users/divya/Udemy_sampleFiles/myUoutput_example_withoutIndex.csv")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [318]:
pd.read_excel("/Users/divya/Udemy_sampleFiles/Excel_Sample.xlsx", sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [319]:
df.to_excel("/Users/divya/Udemy_sampleFiles/Excel_Sample_Output.xlsx",sheet_name='NewSHEET', index=False)

In [321]:
pd.read_excel("/Users/divya/Udemy_sampleFiles/Excel_Sample_Output.xlsx",sheet_name='NewSHEET')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [322]:
#reading html
data = pd.read_html("https://fdic.gov/bank-failures/failed-bank-list")

In [323]:
data

[                               Bank Name               City         State  \
 0                   Pulaski Savings Bank            Chicago      Illinois
 1     The First National Bank of Lindsay            Lindsay      Oklahoma
 2  Republic First Bank dba Republic Bank       Philadelphia  Pennsylvania
 3                          Citizens Bank           Sac City          Iowa
 4               Heartland Tri-State Bank            Elkhart        Kansas
 5                    First Republic Bank      San Francisco    California
 6                         Signature Bank           New York      New York
 7                    Silicon Valley Bank        Santa Clara    California
 8                      Almena State Bank             Almena        Kansas
 9             First City Bank of Florida  Fort Walton Beach       Florida

     Cert                 Aquiring Institution      Closing Date  \
 0  28611                      Millennium Bank  January 17, 2025
 1   4134   First Bank & Trust Co., Duncan, OK  October 18, 2024
 2  27332    Fulton Bank, National Association    April 26, 2024
 3   8758            Iowa Trust & Savings Bank  November 3, 2023
 4  25851               Dream First Bank, N.A.     July 28, 2023
 5  59017            JPMorgan Chase Bank, N.A.       May 1, 2023
 6  57053                  Flagstar Bank, N.A.    March 12, 2023
 7  24735  First Citizens Bank & Trust Company    March 10, 2023
 8  15426                          Equity Bank  October 23, 2020
 9  16748            United Fidelity Bank, fsb  October 16, 2020

    Fund  Sort ascending
 0                 10548
 1                 10547
 2                 10546
 3                 10545
 4                 10544
 5                 10543
 6                 10540
 7                 10539
 8                 10538
 9                 10537  ]

In [325]:
df = pd.DataFrame(data[0])

In [326]:
df

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
1,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
2,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
3,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
4,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
5,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
6,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
7,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
8,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
9,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537

In [347]:
fdic =pd.DataFrame(pd.read_csv('/Users/divya/Udemy_sampleFiles/bank_fdic.csv'))
fdic

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund
0,Pulaski Savings Bank,Chicago,IL,28611,Millennium Bank,17-Jan-25,10548
1,First National Bank of Lindsay,Lindsay,OK,4134,First Bank & Trust Co.,18-Oct-24,10547
2,Republic First Bank dba Republic Bank,Philadelphia,PA,27332,"Fulton Bank, National Association",26-Apr-24,10546
3,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,3-Nov-23,10545
4,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.",28-Jul-23,10544
...,...,...,...,...,...,...,...
566,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,6004
567,Malta National Bank,Malta,OH,6629,North Valley Bank,3-May-01,4648
568,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2-Feb-01,4647
569,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,4646
570,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,4645

In [336]:
df

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
1,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
2,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
3,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
4,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
5,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
6,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
7,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
8,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
9,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537

In [337]:
df.head()

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
1,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
2,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
3,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
4,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544

In [338]:
data[0].head()

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
1,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
2,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
3,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
4,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544

In [ ]:
#reading from sql

In [345]:
from sqlalchemy import create_engine

engine = create_engine('sqlite:///:memory:')

df.to_sql('my_table', engine)

In [346]:
pd.read_sql('my_table', engine)

,index,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,0,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
1,1,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
2,2,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
3,3,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
4,4,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
5,5,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
6,6,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
7,7,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
8,8,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
9,9,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537

In [353]:
fdic.to_sql('my_newTable2', engine, index=False)

ValueError: Table 'my_newTable2' already exists.

In [357]:
pd.read_sql('my_newTable', engine)

,index,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund
0,0,Pulaski Savings Bank,Chicago,IL,28611,Millennium Bank,17-Jan-25,10548
1,1,First National Bank of Lindsay,Lindsay,OK,4134,First Bank & Trust Co.,18-Oct-24,10547
2,2,Republic First Bank dba Republic Bank,Philadelphia,PA,27332,"Fulton Bank, National Association",26-Apr-24,10546
3,3,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,3-Nov-23,10545
4,4,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.",28-Jul-23,10544
...,...,...,...,...,...,...,...,...
566,566,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,6004
567,567,Malta National Bank,Malta,OH,6629,North Valley Bank,3-May-01,4648
568,568,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2-Feb-01,4647
569,569,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,4646
570,570,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,4645

In [352]:
pd.read_sql('my_newTable2', engine)

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund
0,Pulaski Savings Bank,Chicago,IL,28611,Millennium Bank,17-Jan-25,10548
1,First National Bank of Lindsay,Lindsay,OK,4134,First Bank & Trust Co.,18-Oct-24,10547
2,Republic First Bank dba Republic Bank,Philadelphia,PA,27332,"Fulton Bank, National Association",26-Apr-24,10546
3,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,3-Nov-23,10545
4,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.",28-Jul-23,10544
...,...,...,...,...,...,...,...
566,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,6004
567,Malta National Bank,Malta,OH,6629,North Valley Bank,3-May-01,4648
568,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2-Feb-01,4647
569,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,4646
570,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,4645

In [358]:
pd.read_sql('my_table', engine)

,index,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,0,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
1,1,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
2,2,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
3,3,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
4,4,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
5,5,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
6,6,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
7,7,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
8,8,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
9,9,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537